In [ ]:
%reload_ext sql
import pandas as pd
%matplotlib inline

creates a db called retail

In [ ]:
%sql sqlite:///retail.db

'Connected: @retail.db'

this code transfers my csv file into the database

In [ ]:
import sqlite3
import pandas as pd

# Load the CSV file into a pandas dataframe
df = pd.read_csv('business_retailsales.csv')

# Create a connection to the SQLite database
conn = sqlite3.connect('retail.db')

# Write the dataframe to a new table in the database
df.to_sql('business', conn, if_exists='replace', index=False)

# Close the database connection
conn.close()

/usr/local/lib/python3.8/dist-packages/pandas/core/generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [ ]:
%%sql
 SELECT * FROM business LIMIT 15

 * sqlite:///retail.db
Done.

[('Art & Sculpture', 34, 14935.0, -594.0, -1609.0, 12732.0),
 ('Basket', 13, 3744.0, -316.8, 0.0, 3427.2),
 ('Basket', 12, 3825.0, -201.6, -288.0, 3335.4),
 ('Basket', 17, 3035.0, -63.25, 0.0, 2971.75),
 ('Art & Sculpture', 47, 2696.8, -44.16, 0.0, 2652.64),
 ('Basket', 17, 2695.0, -52.5, -110.0, 2532.5),
 ('Basket', 20, 2310.0, -66.0, -110.0, 2134.0),
 ('Christmas', 90, 2160.0, -45.59, 0.0, 2114.41),
 ('Art & Sculpture', 10, 2250.0, -180.0, 0.0, 2070.0),
 ('Basket', 11, 1925.0, -17.5, 0.0, 1907.5),
 ('Basket', 30, 1907.0, -41.3, 0.0, 1865.7),
 ('Home Decor', 19, 1748.0, -46.85, 0.0, 1701.15),
 ('Basket', 15, 1725.0, -92.0, 0.0, 1633.0),
 ('Art & Sculpture', 2, 1625.0, -5.0, 0.0, 1620.0),
 ('Recycled Art', 37, 1554.0, -29.4, 0.0, 1524.6)]

In [ ]:
%%sql

SELECT "Product Type" , "Gross Sales" FROM business GROUP BY "Product Type"

 * sqlite:///retail.db
Done.

[(None, 158.0),
 ('Accessories', 472.0),
 ('Art & Sculpture', 14935.0),
 ('Basket', 3744.0),
 ('Christmas', 2160.0),
 ('Easter', 38.0),
 ('Fair Trade Gifts', 432.0),
 ('Furniture', 350.0),
 ('Gift Baskets', 19.5),
 ('Home Decor', 1748.0),
 ('Jewelry', 1584.0),
 ('Kids', 264.0),
 ('Kitchen', 1104.0),
 ('Music', 328.0),
 ('One-of-a-Kind', 450.0),
 ('Recycled Art', 1554.0),
 ('Skin Care', 1216.0),
 ('Soapstone', 359.0),
 ('Textiles', 564.0)]

In [ ]:
%%sql


SELECT "Product Type" , SUM("Total Net Sales") as "Net Sales per type" 
FROM business  
GROUP BY "Product Type" 
having "Net Sales per type" > 10000

 * sqlite:///retail.db
Done.

[('Art & Sculpture', 84480.84999999999),
 ('Basket', 134791.38999999998),
 ('Christmas', 14460.810000000007),
 ('Home Decor', 25699.99000000001),
 ('Jewelry', 29572.950000000004),
 ('Kitchen', 15336.82000000001)]

In [ ]:
%%sql


SELECT "Product Type", 
       count("Product Type") as "total number of orders per type", 
       sum("Net Quantity") as "Total Quantity Ordered",
       SUM("Total Net Sales") as "Net Sales per type" 
FROM business 
GROUP BY "Product Type"
HAVING "total number of orders per type" > 100 or "Total Quantity Ordered" > 100
ORDER BY "Net Sales per type" DESC

 * sqlite:///retail.db
Done.

[('Basket', 551, 1461, 134791.38999999998),
 ('Art & Sculpture', 337, 1427, 84480.84999999999),
 ('Jewelry', 210, 991, 29572.950000000004),
 ('Home Decor', 131, 404, 25699.99000000001),
 ('Kitchen', 161, 809, 15336.82000000001),
 ('Christmas', 73, 575, 14460.810000000007),
 ('Soapstone', 67, 199, 4629.089999999999),
 ('Kids', 63, 140, 3721.3399999999997),
 ('Skin Care', 11, 101, 2571.8000000000006),
 ('Fair Trade Gifts', 28, 110, 2204.67)]